app/controllers/books_controller.rb

SELECT "books".* FROM "books"
SELECT  "books".* FROM "books" WHERE "books"."Category" = ?  ORDER BY "books"."id" DESC LIMIT 1  [["Category", "3"]]
SELECT COUNT(*) FROM "books" WHERE "books"."Category" = ?  [["Category", "1"]]
---
  def index

    @books = Book.all
    @regularbooks=Book.where(Category: '1')
    @regularbooksnumber=@regularbooks.count

INSERT INTO "books" ("title", "return", "Category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ss"], ["return", "2015-12-23"], ["Category", "1"], ["created_at", "2015-12-15 08:47:08.185932"], ["updated_at", "2015-12-15 08:47:08.185932"]]
---
  def create

    @book = Book.new(article_params)

    if @book.save

SELECT "books".* FROM "books"
SELECT "books".* FROM "books" WHERE "books"."Category" = ?  [["Category", "1"]]
SELECT COUNT(*) FROM "books" WHERE "books"."Category" = ?  [["Category", "1"]]
---
 def invoice
    @books = Book.all
    @regularbooks=Book.where(Category: '1')
    @regularbooksnumber=@regularbooks.count